{
  "backend/main.mo": "Main backend actor defining user profiles, templates, bio pages, subscriptions, and OTP storage with supporting helper functions and system templates.",
  "backend/migration.mo": "Migration module adding a new activeOtps map to the actor’s state with a default empty initialization.",
  "feature_evidence.json": "Feature evidence report mapping OTP-related frontend changes to corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "Generated summaries describing the purpose of each frontend file including pages, components, hooks, and configuration.",
  "frontend/index.css": "Tailwind base and theme variable definitions including light/dark mode color tokens and global styling.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application router and layout setup with authentication and registration guards plus route definitions.",
  "frontend/src/components/BioFormulaHelper.tsx": "UI helper component offering an expandable bio-writing guide and an insertable starter template.",
  "frontend/src/components/BrandHeader.tsx": "Top navigation header handling authentication, user profile state, and links including conditional Pro features and Canva shortcut.",
  "frontend/src/components/LinksEditor.tsx": "Interactive editor for adding, removing, and updating link items within a card UI.",
  "frontend/src/components/PaymentQrUploader.tsx": "Uploads and previews a payment QR image with progress tracking and removal support.",
  "frontend/src/components/PhoneOtpGate.tsx": "Phone verification flow handling OTP generation, submission, and success state.",
  "frontend/src/components/SocialHandlesEditor.tsx": "Editor for managing social handle entries including platform selection and field updates.",
  "frontend/src/components/TemplateBadge.tsx": "Renders a styled badge label for template attributes like trending or most-used.",
  "frontend/src/components/TemplateCard.tsx": "Displays a template preview card with badge, details, and navigation to the template page.",
  "frontend/src/constants/categories.ts": "Exports a list of predefined template category strings and its type.",
  "frontend/src/constants/platformCopy.ts": "Holds shared copy strings for system prompts and About Us content.",
  "frontend/src/constants/subscriptionBenefits.ts": "Defines premium and pro subscription benefits and provides helper functions to retrieve benefit lists for each tier.",
  "frontend/src/data/seedTemplates.ts": "Provides curated seed templates with encoded content and metadata for use when backend templates are unavailable.",
  "frontend/src/data/topInfluencers.ts": "Exports a list of top influencers with Instagram handles grouped by category.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication, exposing identity state, login, logout, and provider context.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for profiles, OTP flows, templates, and phone verification.",
  "frontend/src/index.css": "Defines Tailwind base styles, theming variables, dark mode, typography, and screenshot‑protection rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About Us page showing platform description text and key feature highlights. Uses styled sections and imported ABOUT_US_TEXT.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements subscription checkout flow with UPI payments, payment reference confirmation, and mutation to activate subscriptions. Handles multiple payment methods, errors, and redirects.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with hero content and CTA buttons. Redirects logged‑in users to templates and triggers login when starting.",
  "frontend/src/pages/PhoneVerificationPage.tsx": "Shows a phone OTP verification gate and redirects to signup once verified. Wraps the PhoneOtpGate component with simple navigation logic.",
  "frontend/src/pages/PricingPage.tsx": "Shows Premium and Pro subscription plans with feature lists and gating messages. Allows navigating to checkout with the selected tier.",
  "frontend/src/pages/SharedBioPage.tsx": "Fetches and displays a shared bio page with title, text, social handles, and links. Handles loading and missing-page states with fallback UI.",
  "frontend/src/pages/SignupPage.tsx": "Manages two-step signup: phone verification and profile creation. Submits user details to registration and redirects on success.",
  "frontend/src/pages/TemplateDetailPage.tsx": "Displays details for a selected template, handles bio generation, copying, and screenshot prevention logic.",
  "frontend/src/pages/TemplateEditorPage.tsx": "Provides an editor for customizing template content, parsing editable data, and creating shareable bio pages.",
  "frontend/src/pages/TemplateGalleryPage.tsx": "Shows all templates with category filtering, badges, and loading/error states.",
  "frontend/src/pages/UploadTemplatePage.tsx": "Allows Pro users to upload new templates with metadata, category, and thumbnail handling.",
  "frontend/src/utils/bioAssistant.ts": "Generates rule‑based bio suggestions using prompt keywords and template categories.",
  "frontend/src/utils/upi.ts": "Provides UPI link generation, payment app deep‑link handling, and clipboard utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (query/hash), persist them in sessionStorage, retrieve them with precedence, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, spacing, animations, typography, container settings, and plugin integrations.",
  "project_state.json": "Describes the project’s current architecture, features, known issues, and generated assets for a subscription-based Liinks platform."
}