{
  "backend/main.mo": "Motoko canister defining user profiles, templates, bio pages, storage mixins, access control, and system template seeds with ID generation helpers.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing routing, hooks, UI components, and template data sources.",
  "frontend/index.css": "Tailwind base layers plus extensive OKLCH CSS variable theme definitions for light and dark modes.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, auth guards, and the main app layout with themed header and footer.",
  "frontend/src/components/BrandHeader.tsx": "Responsive header with login/logout, subscription badge, navigation links, and mobile menu.",
  "frontend/src/components/LinksEditor.tsx": "Form component for adding, editing, and removing link items within the bio page editor.",
  "frontend/src/components/PaymentQrUploader.tsx": "React component for uploading and previewing a QR image using ExternalBlob with progress tracking and removal support.",
  "frontend/src/components/SocialHandlesEditor.tsx": "Editor UI for adding, updating, and removing social handles with platform selection and input fields.",
  "frontend/src/components/TemplateCard.tsx": "Displays a template preview card with thumbnail, metadata, and a button to navigate to the template details page.",
  "frontend/src/constants/categories.ts": "Exports a constant list of category strings and a CategoryType union type.",
  "frontend/src/data/seedTemplates.ts": "Provides a large seed array of default Template objects used as fallback when backend templates are unavailable.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity loading through a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, templates, subscriptions, and bio page data, with seed fallbacks.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables plus base utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements UPI-based subscription checkout flow with payment reference submission and subscription activation.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with login flow and navigation to pricing or templates.",
  "frontend/src/pages/PricingPage.tsx": "Shows subscription tiers and pricing, allowing users to start checkout for Premium or Pro plans.",
  "frontend/src/pages/SharedBioPage.tsx": "Fetches and displays a public shared bio page with social handles and links or an error state.",
  "frontend/src/pages/SignupPage.tsx": "Provides a profile signup form and submits user details to create a new profile.",
  "frontend/src/pages/TemplateDetailPage.tsx": "Displays details for a selected template, handles subscription gating, and allows navigating to copy or customize the template.",
  "frontend/src/pages/TemplateEditorPage.tsx": "Provides a form-based editor to customize a template and save a bio page, including link handling and share URL generation.",
  "frontend/src/pages/TemplateGalleryPage.tsx": "Shows a gallery of templates with category filtering and loading states.",
  "frontend/src/pages/UploadTemplatePage.tsx": "Allows Pro users to upload new templates with metadata and thumbnail handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s current state, version, and a list of implemented features including backend canisters, frontend scaffolding, authentication, and UI pages for templates, pricing, signup, and uploads. Serves as a structured inventory of existing functionality for a subscription-based template marketplace."
}