{
  "backend/main.mo": "Defines the backend actor with user profiles, templates, bio pages, OTP storage, subscription tracking, and helper functions plus authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs for error-handling improvements.",
  "frontend-file-summaries.txt": "Lists short summaries for all frontend files, describing key components, pages, hooks, and behaviors.",
  "frontend/index.css": "Tailwind base styles defining color variables for light/dark modes and applying global background and text utilities.",
  "frontend/index.html": "HTML entry point containing root container and script loader for the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout, auth/registration guards, and routes for all major pages.",
  "frontend/src/components/BioFormulaHelper.tsx": "Component offering an expandable card that explains a four-part bio formula and inserts a starter template.",
  "frontend/src/components/BrandHeader.tsx": "Responsive header with navigation, authentication handling, and optional Pro-only upload link.",
  "frontend/src/components/LinksEditor.tsx": "Editor UI for adding, updating, and deleting link items with inputs for title, URL, and description.",
  "frontend/src/components/PaymentQrUploader.tsx": "Component to upload and preview a payment QR image with progress tracking and removal.",
  "frontend/src/components/PhoneOtpGate.tsx": "Multi-step phone verification flow allowing OTP request, entry, validation, and success state.",
  "frontend/src/components/SocialHandlesEditor.tsx": "Editor for managing social handle entries with platform selection and fields for username and URL.",
  "frontend/src/components/TemplateBadge.tsx": "Displays a styled badge for template tags like creator favorite, trending, or most used.",
  "frontend/src/components/TemplateCard.tsx": "Template preview card showing name, description, badge, and navigation to a template detail page.",
  "frontend/src/constants/categories.ts": "Defines the list of supported template categories and corresponding type.",
  "frontend/src/constants/platformCopy.ts": "Contains shared platform messaging strings for system prompts and About Us content.",
  "frontend/src/constants/subscriptionBenefits.ts": "Defines premium and pro subscription benefit lists plus helper functions to retrieve tier-specific benefit text.",
  "frontend/src/data/seedTemplates.ts": "Provides a set of curated default bio-page templates with encoded content for use when backend templates are unavailable.",
  "frontend/src/data/topInfluencers.ts": "Exports a categorized list of top influencers with their Instagram handles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, handling auth state changes and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login, persistence, and context provider with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend API calls in react-query hooks for user profiles, registration, phone verification, OTP, and templates.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, typography, and screenshot-protection rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page displaying platform copy and three highlighted features with styled sections.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements subscription checkout with UPI payment options, reference input, and confirmation logic.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing homepage with hero content, value props, and login or template navigation flow.",
  "frontend/src/pages/PhoneVerificationPage.tsx": "Shows phone OTP verification and redirects to signup once verified.",
  "frontend/src/pages/PricingPage.tsx": "Displays Premium and Pro subscription plans, benefits, and gating messages, with navigation to checkout.",
  "frontend/src/pages/SharedBioPage.tsx": "Fetches and renders a public bio page with title, text, social handles, and links, or shows errors/loading states.",
  "frontend/src/pages/SignupPage.tsx": "Handles phone verification and profile creation during signup, with error handling and navigation.",
  "frontend/src/pages/TemplateDetailPage.tsx": "Displays a template’s details, prevents screenshots, and provides local bio generation with copy and external links.",
  "frontend/src/pages/TemplateEditorPage.tsx": "Loads a template for editing, handles prerequisite checks, and allows creating and sharing personalized bio pages.",
  "frontend/src/pages/TemplateGalleryPage.tsx": "Shows all templates with category filtering, badge labels, loading states, and fallback error UI.",
  "frontend/src/pages/UploadTemplatePage.tsx": "Allows Pro users to upload new templates with thumbnail handling, validation, and server submission.",
  "frontend/src/utils/backendErrors.ts": "Normalizes backend errors into user-friendly messages and detects prerequisite-related issues.",
  "frontend/src/utils/bioAssistant.ts": "Generates offline, rule-based bio suggestions using prompt analysis and category-specific templates.",
  "frontend/src/utils/upi.ts": "Provides helpers to build UPI payment links, open Google Pay or PhonePe via deep links, and copy text to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Handles extracting, storing, retrieving, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, container settings, animations, and utilities.",
  "project_state.json": "Tracks project state, known issues, and feature requests related to role‑assignment errors and Create & Share flow failures."
}