{
  "backend/main.mo": "Main backend actor defining user profiles, templates, bios, subscriptions, and storage/authorization mixins, plus system template seeds and helper ID generators.",
  "backend/migration.mo": "Migration module adding pending and confirmed subscription maps while preserving existing user profiles.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files and their recent updates across pages, components, and utilities.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, dark mode tokens, and base styles.",
  "frontend/index.html": "Minimal HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app routing setup with auth/registration guards, layout, and page routes.",
  "frontend/src/components/BioFormulaHelper.tsx": "UI helper card providing a 4-part bio writing formula with expandable details and an insert action.",
  "frontend/src/components/BrandHeader.tsx": "Header component handling navigation, authentication, mobile menu, and conditional pro-user upload link.",
  "frontend/src/components/LinksEditor.tsx": "Editable list UI for adding, updating, and removing link items.",
  "frontend/src/components/PaymentQrUploader.tsx": "Handles image upload for a payment QR code with progress, preview, and removal.",
  "frontend/src/components/SocialHandlesEditor.tsx": "Editor for managing social handle entries with platform selection and CRUD controls.",
  "frontend/src/components/TemplateBadge.tsx": "Renders a badge with predefined label and styles based on template variant.",
  "frontend/src/components/TemplateCard.tsx": "Displays a template preview card with image, metadata, optional badge, and navigation button.",
  "frontend/src/constants/categories.ts": "Defines a constant list of template category strings and a corresponding type.",
  "frontend/src/data/seedTemplates.ts": "Provides seed template data with metadata, thumbnails, and encoded editable content for initial population.",
  "frontend/src/data/topInfluencers.ts": "Defines an Influencer interface and exports a curated list of influencer profiles grouped by category.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, templates, and subscription data using the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind-based styles, CSS variables, dark mode, and screenshot protection rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the subscription checkout UI with UPI payment flows and triggers subscription activation through backend mutations.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that handles login, redirects authenticated users to templates, and displays hero and value sections.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page showing Premium and Pro plans, gating messages, and plan selection navigation.",
  "frontend/src/pages/SharedBioPage.tsx": "Public page to view a shared bio, with loading/error states and sections for socials and links.",
  "frontend/src/pages/SignupPage.tsx": "Signup form for creating a user profile, submitting data via mutation, and navigating to templates on success.",
  "frontend/src/pages/TemplateDetailPage.tsx": "Displays template details, influencer examples, and supports AI-generated bio content while blocking screenshots.",
  "frontend/src/pages/TemplateEditorPage.tsx": "Editor for customizing a template’s bio, links, and socials, initializing fields from editable content and saving new bio pages.",
  "frontend/src/pages/TemplateGalleryPage.tsx": "Renders the template gallery with category filters, loading states, error alerts, and badge mapping for certain templates.",
  "frontend/src/pages/UploadTemplatePage.tsx": "Implements the Pro‑gated template upload form with thumbnail upload, validation, and submission to the template upload API.",
  "frontend/src/utils/upi.ts": "Provides utilities to generate UPI payment links, trigger Google Pay or PhonePe intents, and copy text to clipboard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, typography, and container settings for the frontend.",
  "project_state.json": "Describes the project’s state, architecture, subscription flow, known issues, and generated template thumbnail assets."
}