{
  "backend/main.mo": "Defines the backend canister with user profiles, templates, bio pages, sharing logic, and system template seeds plus authorization and blob‑storage mixins.",
  "feature_evidence.json": "Lists feature evidence mapping features to modified files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing UI pages, components, and subscription‑removal changes.",
  "frontend/index.css": "Defines global Tailwind CSS variables and dark mode settings for the app’s design system.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, auth guards, and page mappings for the frontend.",
  "frontend/src/components/BrandHeader.tsx": "Header component with navigation, login/logout handling, and conditional Pro‑only upload links.",
  "frontend/src/components/LinksEditor.tsx": "Form component allowing users to add, edit, and remove link entries in a bio page.",
  "frontend/src/components/PaymentQrUploader.tsx": "Component for uploading and previewing a QR image with progress tracking and removal support.",
  "frontend/src/components/SocialHandlesEditor.tsx": "Editor UI for adding, updating, and removing social media handles with selectable platforms.",
  "frontend/src/components/TemplateCard.tsx": "Displays a template card with thumbnail, metadata, and a button to navigate to the detailed template view.",
  "frontend/src/constants/categories.ts": "Exports a static list of template categories and a CategoryType type derived from it.",
  "frontend/src/data/seedTemplates.ts": "Provides a large predefined list of seed template objects for fallback or initial template data.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login flow, persistence, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, templates, subscriptions, and related data using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers, defines light/dark theme CSS variables, applies base styles, and adds screenshot‑protection rules.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and mounts the root component.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders UPI-based checkout flow allowing users to submit payment reference and activate a subscription.",
  "frontend/src/pages/LandingPage.tsx": "Displays marketing landing page with login flow and redirects logged-in users to templates.",
  "frontend/src/pages/PricingPage.tsx": "Shows Premium and Pro subscription tiers, feature lists, and routes users to checkout.",
  "frontend/src/pages/SharedBioPage.tsx": "Fetches and displays a shared bio page with social handles and links, handling loading and error states.",
  "frontend/src/pages/SignupPage.tsx": "Provides a profile setup form for new users and submits data to create their account.",
  "frontend/src/pages/TemplateDetailPage.tsx": "Displays a single template’s details, handles screenshot-prevention, and routes users to edit or return if not found.",
  "frontend/src/pages/TemplateEditorPage.tsx": "Provides a form to customize and save a bio page from a template and generates a share URL after saving.",
  "frontend/src/pages/TemplateGalleryPage.tsx": "Shows all templates with category filtering, loading states, and error handling.",
  "frontend/src/pages/UploadTemplatePage.tsx": "Allows Pro users to upload new templates with metadata and thumbnail handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, colors, animations, and plugin setup.",
  "project_state.json": "Describes the project’s current state, including schema metadata and a list of implemented features covering backend canisters, storage, authentication, and various frontend pages and editors. Serves as a structured inventory of existing functionality for the Liinks template marketplace."
}