{
  "kind": "build_request",
  "title": "Fix checkout payments and add Razorpay, GPay, and PhonePe options",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Fix the subscription purchase flow so payment confirmation reliably activates Premium/Pro for registered users (resolve the current “paying is not working” issue). Ensure the backend authorization state allows a newly registered user to call subscription APIs without trapping as unauthorized.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "paying is not working  ...add the razor pay and gpay and phonepay"
        ]
      },
      "acceptanceCriteria": [
        "After a user completes Signup, calling backend subscribe(...) does not trap with an authorization error.",
        "If a user is not registered, subscribe(...) returns a clear error (trap message) indicating registration is required.",
        "Manual QA: signup → checkout → confirm payment results in hasActiveSubscription() returning true and UI gating unlocking Premium/Pro as expected."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add explicit payment method options in the Checkout UI for INR subscriptions: Razorpay, Google Pay (GPay), and PhonePe. The page must present these as clear selectable options and guide the user through completing payment for the selected tier amount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "add the razor pay and gpay and phonepay"
        ]
      },
      "acceptanceCriteria": [
        "Checkout page shows payment method choices that include: Razorpay, Google Pay (GPay), and PhonePe.",
        "Selecting a method updates the instructions/CTA shown to the user for that method.",
        "All user-facing copy is in English."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement UPI intent/deep-link support for Google Pay (GPay) and PhonePe on the Checkout page using the configured receiver UPI ID and the correct plan amount, so that tapping the button opens the corresponding UPI app when available (and gracefully falls back to copy-to-clipboard if not).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "add the razor pay and gpay and phonepay"
        ]
      },
      "acceptanceCriteria": [
        "For both Premium (₹199) and Pro (₹499), the Checkout page can generate a UPI payment intent link that includes payee VPA (UPI ID) and amount.",
        "Buttons for Google Pay and PhonePe attempt to open the respective app via intent/deep-link; if opening fails, the UI provides a copy-to-clipboard fallback (UPI ID and/or UPI link).",
        "The existing “UPI ID copied to clipboard” behavior continues to work."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Capture the user’s payment reference / transaction ID during confirmation and persist it in the backend as part of the subscription activation record (so support can audit what the user entered). Update the API surface as needed and keep the frontend confirmation form wired to the backend call.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "paying is not working  ...add the razor pay and gpay and phonepay"
        ]
      },
      "acceptanceCriteria": [
        "Checkout confirmation cannot proceed without a non-empty payment reference / transaction ID (existing validation preserved).",
        "Backend stores the submitted payment reference alongside the user’s subscription activation (data retrievable for admins/devs via a backend query or by extending an existing user profile return shape).",
        "If backend state/schema changes are required, a conditional backend migration is added so existing deployments upgrade safely without losing userProfiles."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if state schema changes.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "No third-party authentication beyond Internet Identity.",
    "No external databases or non-Motoko backend services."
  ],
  "nonGoals": [
    "Implementing real-time payment verification with Razorpay webhooks or external servers.",
    "Adding non-INR payment rails (cards, PayPal, crypto wallets).",
    "Building a full transaction ledger UI for users (beyond storing the reference and activating subscription)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}