{
  "kind": "build_request",
  "title": "Fix 'Only admins can assign user role' blocking registration and Create & Share flow",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the backend registration flow so newly registered users are not blocked by the error \"Only admins can assign user role\" when assigning the default user role after signup.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "its not working its saying only admins can assign user role"
        ]
      },
      "acceptanceCriteria": [
        "Calling backend registerProfile as a non-admin principal succeeds when the phone number is verified and the user is not already registered.",
        "After registerProfile succeeds, the caller has the expected default role (e.g., #user) without requiring any admin privileges.",
        "The backend no longer traps with any message containing \"Only admins can assign user role\" during normal signup/registration flows.",
        "No state migration is introduced unless strictly required by a state shape change (avoid migration for logic-only changes)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve frontend error handling for signup/registration so that if any backend authorization/role assignment error occurs, the UI shows a clear English error message and provides a next step (e.g., retry registration, verify phone, or contact admin) instead of appearing to do nothing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "its not working its saying only admins can assign user role"
        ]
      },
      "acceptanceCriteria": [
        "When registerProfile fails, the UI displays a visible error message in English (toast and/or inline) that includes the backend error text when available.",
        "If the failure message contains admin/role assignment wording, the UI shows a friendly message indicating this is a configuration issue and suggests retrying later or contacting an admin (without exposing internal stack traces).",
        "The signup page does not get stuck in a loading state after a failed registration attempt; the user can edit inputs and retry."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the Create & Share (Save & Share Bio Page) flow fails loudly with actionable messages when prerequisites are missing (not logged in, not registered, phone not verified) rather than silently failing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "its not working its saying only admins can assign user role"
        ]
      },
      "acceptanceCriteria": [
        "If the user is not authenticated, the editor blocks saving and shows an English message instructing the user to log in.",
        "If the backend rejects createBioPage due to missing profile/registration, the UI shows an English message instructing the user to complete signup, and offers navigation to /signup (or indicates where to go) instead of only logging to console.",
        "If the backend rejects due to phone not verified, the UI shows an English message instructing the user to verify their phone, and offers navigation to /verify-phone (or indicates where to go)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files in frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not grant or simulate external Pro/Premium subscriptions for third-party platforms (e.g., Liinks) or attempt to verify/claim ownership of external accounts.",
    "Do not add third-party authentication providers beyond Internet Identity.",
    "Do not add new backend persistence layers or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}