{
  "kind": "build_request",
  "title": "Unblock template viewing and remove subscription/paywall gating",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Make template browsing and viewing work for all users (including guests and unregistered users) so the Template Gallery and Template Detail pages always show template content.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I CANT VIEW AND SEE ANY  TEMPLATE CONTENT"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /templates while logged out renders a non-empty grid of templates (at minimum the existing seed templates) with each card showing name, category, and description.",
        "Visiting /templates/$templateId while logged out renders the template detail page content (title, category badge, description, and preview image area) without crashing.",
        "If the backend call to fetch templates fails or is unauthorized, the UI still renders templates via the existing seed template fallback (no blank/empty page)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Remove subscription/paywall gating from the template flow so users are not blocked from copying/customizing templates due to subscription status.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "REMOVE THE SUBSCRIPTION THING"
        ]
      },
      "acceptanceCriteria": [
        "Remove the router-level subscription guard so the editor route /editor/$templateId is not wrapped by RequireSubscription in frontend/src/App.tsx.",
        "Template detail CTA no longer routes users to /pricing due to missing subscription; the primary CTA should only depend on authentication/registration requirements (e.g., prompt login if logged out, otherwise allow continuing to editor).",
        "All user-facing copy on TemplateGalleryPage, TemplateDetailPage, and TemplateEditorPage is updated to remove subscription-required messaging (use English text).",
        "Brand header subscription badge is removed or no longer depends on subscription state (no Premium/Pro badge based on subscription)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Remove subscription enforcement from backend operations involved in customizing templates so saving a bio page does not require an active subscription.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "REMOVE THE SUBSCRIPTION THING"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo: createBioPage no longer checks subscription/subscriptionExpiry and no longer traps with \"Subscription required to save bio page\".",
        "Authenticated, registered users without any subscription can create/save a bio page successfully using the existing frontend editor save flow.",
        "No migration is introduced unless required by compilation/state changes (follow conditional migration policy)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Make template listing endpoints publicly accessible (no registration/role requirement) so template content can be fetched from the backend without requiring a registered user permission.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I CANT VIEW AND SEE ANY  TEMPLATE CONTENT"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo: getAllTemplates and getTemplatesByCategory no longer trap based on AccessControl.hasPermission(..., #user).",
        "Calling getAllTemplates as an anonymous/guest caller returns an array (may include dynamic templates and/or system templates) instead of trapping.",
        "Frontend template gallery can fetch backend templates without requiring the user to be registered."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in backend/main.mo; only add backend/migration.mo if an actual state upgrade is required.",
    "Do not edit files under frontend/src/components/ui or the immutable hook paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Removing the Pricing and Checkout pages entirely (they may remain, but must not block template viewing/copying due to subscription checks).",
    "Adding new third-party authentication or payment providers beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}