{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phone-number OTP verification gate for signup and registered access (frontend-only)",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Update Signup page to require phone-number OTP verification before enabling profile registration submission.",
      "acceptanceCriteria": [
        "Signup page collects phone number, lets the user request an OTP, then prompts for OTP input and verifies it before enabling the existing profile form submission.",
        "After OTP verification succeeds, the user can complete the existing signup fields and submit registration successfully.",
        "User-facing text is in English and clearly explains the steps (enter phone → request OTP → enter OTP → continue).",
        "Error states are handled with clear messages (invalid OTP, expired OTP, too many attempts if implemented, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "modify",
          "description": "Refactor the signup flow into a phone-verification-first, multi-step UI: (1) phone input + request OTP, (2) OTP entry + verify, (3) existing profile fields + submit. Disable profile submission until verification succeeds; show clear English step guidance and handle backend errors (invalid/expired/missing OTP) with user-friendly messages. Ensure the email field remains a normal profile field (no email verification)."
        },
        {
          "path": "frontend/src/components/PhoneOtpGate.tsx",
          "operation": "create",
          "description": "Create a reusable Phone OTP gate component used by Signup and the dedicated verification route. It should manage: phone input, request-OTP action, OTP input, verify action, step transitions, and a success state that notifies the parent when verified."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add a dedicated /verify-phone route and adjust registration-required guard behavior so authenticated-but-unregistered users can complete phone verification and then registration without redirect loops.",
      "acceptanceCriteria": [
        "A user who is authenticated (Internet Identity) but not registered can complete phone OTP verification and then complete profile registration without getting stuck in redirects.",
        "The routing/guard behavior remains consistent with the existing `RequireAuth` / `RequireRegistered` pattern in `frontend/src/App.tsx`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PhoneVerificationPage.tsx",
          "operation": "create",
          "description": "Add a dedicated phone verification page that renders the shared PhoneOtpGate component. After successful verification, guide the user to continue to profile registration (navigate to /signup with a clear reason parameter for messaging)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new authenticated route for /verify-phone (wrapped in RequireAuth) and wire it into the router tree. Update the existing registration-required redirect flow (RequireRegistered → redirect) to avoid trapping users: when profile is missing, redirect users to /verify-phone (or to /signup with a verification step) in a deterministic way that allows proceeding to registration afterwards."
        },
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "modify",
          "description": "Ensure /signup can accept navigation from /verify-phone and does not cause redirect loops: if arriving after verification, skip/mark the phone OTP step as complete and allow profile submission; keep the existing reason-based guidance messaging in English."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Add React Query hooks for OTP request/verify/status and wire them to the backend actor for clean UI state updates.",
      "acceptanceCriteria": [
        "`frontend/src/hooks/useQueries.ts` (or equivalent hook location) includes mutations/queries to request OTP, verify OTP, and check verification status using the backend actor.",
        "OTP mutations have success/error handling suitable for the Signup UI (e.g., enabling next step on success).",
        "No changes are made to immutable hook files listed in `frontend.immutablePaths`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add hooks for OTP operations using the existing actor + React Query patterns: (1) mutation to request OTP, (2) mutation to verify OTP, and (3) query to check verification status (isPhoneVerified). Ensure hooks expose error/success signals suitable for step transitions and invalidate/refresh the phone-verification status query on success."
        },
        {
          "path": "frontend/src/components/PhoneOtpGate.tsx",
          "operation": "modify",
          "description": "Integrate the new OTP hooks into the shared component so UI actions call the canister through the actor and update UI state cleanly (loading, success, error)."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Show an explicit in-app OTP delivery limitation message (no SMS) and provide clear instructions for obtaining the OTP in this environment.",
      "acceptanceCriteria": [
        "The app does not claim that an SMS was sent if there is no SMS integration.",
        "The user sees clear instructions on how to proceed with OTP in the current build environment (English copy)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PhoneOtpGate.tsx",
          "operation": "modify",
          "description": "When OTP is requested, display a clear English message that this build does not send SMS and explain how to obtain the OTP. Implement a safe, explicit fallback for the current environment (e.g., show the generated OTP code in-app after requesting) without implying an SMS was sent."
        },
        {
          "path": "frontend/src/utils/otp.ts",
          "operation": "create",
          "description": "Add a small utility for generating a user-enterable OTP code for this environment (e.g., numeric code). Use it to support the no-SMS flow so the UI can instruct users how to proceed without third-party providers."
        }
      ]
    }
  ]
}