{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve signup + Create & Share error handling and prerequisite messaging",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Show clear, actionable English errors on signup when registration fails (including role/authorization failures) and ensure the UI is never stuck loading.",
      "acceptanceCriteria": [
        "When registerProfile fails, the UI displays a visible error message in English (toast and/or inline) that includes the backend error text when available.",
        "If the failure message contains admin/role assignment wording, the UI shows a friendly message indicating this is a configuration issue and suggests retrying later or contacting an admin (without exposing internal stack traces).",
        "The signup page does not get stuck in a loading state after a failed registration attempt; the user can edit inputs and retry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/backendErrors.ts",
          "operation": "create",
          "description": "Add a small shared helper to normalize backend errors into safe, user-friendly English messages (e.g., detect role/admin/authorization wording like \"Only admins can assign user role\" and map to actionable guidance) while preserving the raw backend error text when appropriate. Use this to support graceful handling of authorization traps as recommended by the authorization component. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "modify",
          "description": "Improve registerProfile failure handling: use the new backend error normalization helper to show a clear toast plus an inline Alert with next steps (retry, verify phone, contact admin when role/admin wording is detected). Ensure local error state is set/cleared appropriately and the form remains editable after failure (no stuck pending UI)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure registerProfile mutation errors propagate consistently with useful error messages (no swallowed errors) so SignupPage can display the backend error text when available; keep behavior aligned with authorization-style trap errors."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make Create & Share (Save & Share Bio Page) loudly block and guide users when prerequisites are missing (not logged in, not registered, phone not verified).",
      "acceptanceCriteria": [
        "If the user is not authenticated, the editor blocks saving and shows an English message instructing the user to log in.",
        "If the backend rejects createBioPage due to missing profile/registration, the UI shows an English message instructing the user to complete signup, and offers navigation to /signup (or indicates where to go) instead of only logging to console.",
        "If the backend rejects due to phone not verified, the UI shows an English message instructing the user to verify their phone, and offers navigation to /verify-phone (or indicates where to go)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add lightweight React Query hooks for prerequisite checks used by the editor (e.g., isRegistered, isPhoneVerified) using existing backend capabilities, so TemplateEditorPage can block Save & Share before attempting createBioPage."
        },
        {
          "path": "frontend/src/pages/TemplateEditorPage.tsx",
          "operation": "modify",
          "description": "Before calling createBioPage, explicitly check prerequisites (authenticated, registered, phone verified). If missing, block saving and show actionable English messaging with navigation to /signup or /verify-phone as appropriate. On backend rejection, use the shared backend error normalization helper to detect registration/phone/authorization failures and present loud, actionable guidance (toast and/or inline near the Save button), avoiding console-only failures. This aligns with authorization component guidance on handling trap-based authorization errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/backendErrors.ts",
          "operation": "modify",
          "description": "Extend the backend error normalization helper to classify Create & Share failure cases (not registered/profile missing, phone not verified, authorization/role wording) and return recommended user actions (e.g., navigate to /signup or /verify-phone) with safe, English messages. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}