{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Checkout UI payment options + UPI intents and payment reference wiring",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Add Razorpay, Google Pay (GPay), and PhonePe as explicit selectable payment methods in the Checkout UI for INR tiers, updating instructions/CTA based on selection.",
      "acceptanceCriteria": [
        "Checkout page shows payment method choices that include: Razorpay, Google Pay (GPay), and PhonePe.",
        "Selecting a method updates the instructions/CTA shown to the user for that method.",
        "All user-facing copy is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Add a payment method selector UI (Razorpay, Google Pay, PhonePe) and conditionally render method-specific instructions/primary CTA for the selected tier amount. Keep all copy in English, and keep existing QR upload + confirmation section intact."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement UPI intent/deep-link flows for GPay and PhonePe with a graceful fallback to copy-to-clipboard, preserving existing UPI ID copy behavior.",
      "acceptanceCriteria": [
        "For both Premium (₹199) and Pro (₹499), the Checkout page can generate a UPI payment intent link that includes payee VPA (UPI ID) and amount.",
        "Buttons for Google Pay and PhonePe attempt to open the respective app via intent/deep-link; if opening fails, the UI provides a copy-to-clipboard fallback (UPI ID and/or UPI link).",
        "The existing “UPI ID copied to clipboard” behavior continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/upi.ts",
          "operation": "create",
          "description": "Create a small UPI utility module to build a standard UPI payment link (including payee VPA and amount) and helper(s) to attempt app-open for Google Pay and PhonePe with a timeout-based fallback signal for the UI to show copy-to-clipboard options."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Use the new UPI utilities to generate the correct UPI link for Premium (₹199) and Pro (₹499), wire Google Pay and PhonePe CTAs to attempt to open their respective deep-link/intent flows, and on failure present copy-to-clipboard actions for UPI ID and/or UPI link while preserving the existing 'UPI ID copied to clipboard' toast behavior."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Require a non-empty payment reference/transaction ID on confirmation and send it with the subscription initiation call so it is persisted by the backend activation record.",
      "acceptanceCriteria": [
        "Checkout confirmation cannot proceed without a non-empty payment reference / transaction ID (existing validation preserved).",
        "Backend stores the submitted payment reference alongside the user’s subscription activation (data retrievable for admins/devs via a backend query or by extending an existing user profile return shape).",
        "If backend state/schema changes are required, a conditional backend migration is added so existing deployments upgrade safely without losing userProfiles."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the subscription mutation hook to accept a paymentReference/transactionId string and call the existing backend capability that includes a payment reference (per frontend/src/backend.d.ts: initiateSubscription(tier, duration, paymentReference)). Ensure React Query invalidations for subscription/user profile remain in place."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Wire the confirmation form's paymentReference state into the subscription mutation call, ensuring confirmation cannot proceed with an empty value (keep current validation/toast). Also improve error-to-toast mapping so backend authorization/registration errors are shown clearly to the user."
        }
      ]
    }
  ]
}